import cdsapi

# 创建CDS客户端
c = cdsapi.Client(
    url="https://cds.climate.copernicus.eu/api",
    key="aa1478eb-bf4f-4ff4-b548-c87b6b31a82a"
)

# 要下载的年份列表
years = ["2022"]
# 佛子岭流域范围：[北,西,南,东]
bbox = [31.3, 116.2, 31.1, 116.4]

for year in years:
    for month in ["01","02","03","04","05","06","07","08","09","10","11","12"]:
        print(f"===== 提交任务：{year}年{month}月 =====")
        c.retrieve(
            'reanalysis-era5-land',
            {
                'variable': ['total_precipitation'], # 只下载总降水量
                'year': year,
                'month': month,
                'day': ['01','02','03','04','05','06','07','08','09','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31'],
                'time': ['00:00','01:00','02:00','03:00','04:00','05:00','06:00','07:00','08:00','09:00','10:00','11:00','12:00','13:00','14:00','15:00','16:00','17:00','18:00','19:00','20:00','21:00','22:00','23:00'],
                'area': bbox,
                'format': 'netcdf',
            },
            f"era5_{year}_{month}.nc"
        )
        print(f"{year}年{month}月 下载完成\n")

print("全部任务执行完毕")